[
  {
    "name": "KIKI W.",
    "location": "Torrance,CA",
    "stars": 5,
    "date": "12/10/2021",
    "body": "I've used these guys multiple times! Always so friendly and very helpful. Great price, great service. Couldn't recommend them more."
  },
  {
    "name": "JIM Q",
    "location": "SeAl Beach,CA",
    "stars": 5,
    "date": "6/20/2021",
    "body": "Luis and Miguel did an excellent job! They were both very professional, courteous and on-time. Strong, like two Vikings, the two made my move from an upstairs apartment look like a breeze. I gave them both instructions only once at the beginning of the move and then I sat back and relaxed while they did all the work. Luis and Miguel remembered everything I instructed with no need for me to repeat myself. They used their professional experience to move items quickly and efficiently. This is the second time I have used Viking, and I'll surely use them again! They are the moving heroes!  - Thank you Viking!"
  },
  {
    "name": "Kandis M",
    "location": "Long Beach,CA",
    "stars": 5,
    "date": "6/8/2021",
    "body": "Joshua was AWESOME!! He moved me in April on the 20th and then moved my auntie a week later on the 27th. There was an issue at the apartment she rented so he had to move her stuff again but to a storage and then to her new place a week after that in May."
  },
  {
    "name": "Ashwin J.",
    "location": "Los Angeles,CA",
    "date": "7/5/2020",
    "body": "The smoothest move I've ever had.  Period. Last week i had the pleasure of working with Fred, Luis, and Felipe.  My  is pregnant and we both had to work during the day, so we opted for the full packing service, which was quite a deal.  The team packed up our  downtown LA apartment in less than 4 hours and arrived to our new home in La Canada Flintridge without any issues or damaged items.We literally did NOTHING for the entire move. The team was excellent, courteous, and diligent the entire time. HIGHLY recommend Viking Moving for a hassle free move."
  },
  {
    "name": "Brian P",
    "location": "Irvine,CA",
    "date": "3/22/2021",
    "body": "I was looking for reliable, customer service focused, and professional company to help me move my elderly parents.  I've unfortunately had enough negative experiences in the past to go with just anyone.  Viking met all my expectations.  Josh in particular, was both very professional and personable over the phone when I first contacted them to get more information.  It was clear to me that Josh was making a sincere effort to be transparent about their services and to provide various options to help me in my unique situation.  He has great follow through and proved that he was attentive to my specific needs for this move.  I highly recommend this company and applaud them for having genuine customer service!"
  },
  {
    "name": "Stephen C",
    "location": "Long Beach,CA",
    "date": "4/27/2021",
    "body": "These guys were awesome! I scheduled 3 movers with their 20ft truck. I had a large 1 bedroom loft (1450 sq ft) with a large king bed, large sectional, table and chairs, bookshelves, boxes, everything. These guys came promptly, wrapped everything in blankets and were incredibly fast. They couldn't get the bed frame around the last corner in the stairwell (4 floors) and one of the guys came back with a tool bag and dissembled the frame to get it the last leg. When they brought things to the new place they helped arrange everything and had some good tips for where things should go! Finally the guy that dissembled the bed re-assembled it for me. I'd highly recommend!"
  },
  {
    "name": "VonD I",
    "location": "Long Beach,CA",
    "date": "2/3/2021",
    "body": "They did a great job by coming in and packing my house. I utilized packing and moving services and it made moving much easier. They sent 3 guys and they were ready to get the job done. Really special thanks to Josh who heard me out and made sure all my stuff was taken care of - the way I wanted it. Josh made sure it was done right! Thumbs up"
  },
  {
    "name": "Bree X",
    "location": "6/7/2020",
    "date": "6/7/2020",
    "body": "Great, hard working team with excellent communication about my expectations and their abilities. They took care of my belongings and listened to my concerns. They were honest and fun to work with.Even the team on the phone from the very beginning getting a quote through Yelp, it was just a good experience. They made moving easier on me, which is amazing! Highly recommend. Fair prices too."
  },
  {
    "name": "ShanShan W.",
    "location": "Torrance,CA",
    "date": "4/18/2020",
    "body": "Yelp did not let me down-so glad I found these guys! I submitted a quote request via Yelp, and Josh contacted me right away and connected over the phone to review the details. A few days prior to the move, Josh reached out to touch base and addressed some last minute questions I had.  On the day of the move, the lead mover Farkhat and Luis showed up right on time (with PPE!!) These two guys were hustling throughout the move and were very professional!  I will use Viking again for its stellar service, competitive price, and proactive communication!"
  }
]
